Repository: mozilla-l10n/mt-training-data
Catalog: ug/ug_pontoon.tmx
Source language: en_us
Languages: ug

source: If something looks broken on this site, try turning it off.
ug: ئەگەر بۇ تور بېكەتتە بىرەر نەرسە بۇزۇلغاندەك كۆرۈنسە، ئۇنى تاقاپ سىناپ بېقىڭ.

source: Inactive Tabs
ug: ئاكتىپسىز بەتكۈچ

source: Include %1$@ Download Link on %2$@ Shares
ug: %2$@ غا ھەمبەھىرلىگەن مەزمۇندا %1$@ چۈشۈرۈش ئۇلانمىسى بار

source: Include on Homepage
ug: باش بەتتە كۆرۈنىدۇ

source: Increase text size
ug: تېكىستنى چوڭايت

source: Increase Zoom Level
ug: چوڭايتىش دەرىجىسىنى يۇقىرىلات

source: Indie. Non-profit. For good.
ug: مۇستەقىل. پايدا تاپمايدىغان. ياخشىلاش ئۈچۈن.

source: Info Coming Soon
ug: ئۇچۇر پات يېقىندا كېلىدۇ

source: *Is %@ already your default?* Close this message and tap Skip.
ug: *%@ئاللىبۇرۇن كۆڭۈلدىكى توركۆرگۈ؟* بۇ ئۇچۇرنى تاقاپ «ئاتلا» نى چېكىڭ.

source: %@ is asking to download a file and add an event to your calendar.
ug: %@ بىر ھۆججەت چۈشۈرۈپ يىلنامىڭىزگە بىر پائالىيەت قوشىدۇ.

source: Island
ug: ئارال

source: %@ is off-duty. We suggest turning protections back on.
ug: %@ ۋەزىپىسىدىن توختىدى. قوغداشنى قايتا ئېچىشىڭىزنى تەۋسىيە قىلىمىز.

source: %@ is on guard
ug: %@ قوغداۋاتىدۇ

source: Issuer Name
ug: تارقاتقۇچىنىڭ ئىسمى

source: It may be a misconfiguration or tampering by an attacker. Proceed if you accept the potential risk.
ug: بۇ بەلكىم خاتا تەڭشەك ياكى ھۇجۇمچىنىڭ ھەرىكىتى سەۋەبىدىن بولۇشى مۇمكىن. ئەگەر يوشۇرۇن خەتەرنى قوبۇل قىلسىڭىز داۋاملاشتۇرۇڭ.

source: Jump Back In
ug: ئالدىنقى بەتكە قايت

source: just now
ug: ھازىر

source: Just to confirm, you wanted ‘Clear Private Tabs’?
ug: جەزملەيدىغىنىڭىز، «شەخسىي بەتكۈچنى تازىلا» مسىز؟

source: Just to confirm, you wanted ‘Go to Copied Link’?
ug: جەزملەيدىغىنىڭىز، «كۆچۈرۈلگەن ئۇلانمىغا يۆتكەل» ەمسىز؟

source: Just to confirm, you wanted ‘New Private Search’?
ug: جەزملەيدىغىنىڭىز، «يېڭىدىن شەخسىي ئىزدە» مسىز؟

source: Just to confirm, you wanted ‘New Search’?
ug: جەزملەيدىغىنىڭىز، «يېڭىدىن ئىزدە» مسىز؟

source: Keep searches within reach.
ug: ئىزدەشنى ئوڭايلا داۋاملاشتۇرىدۇ.

source: Last Hour
ug: ئاخىرقى سائەت

source: Last month
ug: ئۆتكەن ئاي

source: Last week
ug: ئۆتكەن ھەپتە

source: Learn about useful features and how to get the most out of %@.
ug: پايدىلىق ئىقتىدارلار ۋە %@ دىن قانداق قىلغاندا تېخىمۇ ئۈنۈملۈك پايدىلىنىشنى ئۆگىنىڭ.

source: Learn How
ug: قانداق ئىشلىتىشنى ئۆگىنىش

source: Learn More.
ug: تەپسىلاتى.

source: Learn more about how %@ determines review quality
ug: %@ نىڭ باھالاش سۈپىتىنى قانداق بېكىتىدىغانلىقى ھەققىدىكى تەپسىلاتلار

source: Licenses
ug: ئىجازەتنامە

source: Limited Edition
ug: چەكلىك نەشرى

source: Limited Edition Wallpaper
ug: چەكلىك نۇسخىدىكى تام قەغىزى

source: Load in Background
ug: ئارقا سۇپىدا يۈكلە

source: Loading content…
ug: مەزمۇننى يۈكلەۋاتىدۇ…

source: Loading in Firefox
ug: Firefox تا يۈكلەۋاتىدۇ

source: Load original page
ug: ئەسلى بەتنى يۈكلە

source: Log in
ug: كىرىش

source: Logins & Passwords
ug: كىرىش ۋە ئىم

source: Logins will be permanently removed.
ug: تىزىمغا كىرىش ئۇچۇرى مەڭگۈلۈك چىقىرىۋېتىلىدۇ.

source: Logins will be removed from all connected devices.
ug: تىزىمغا كىرىش ئۇچۇرى باغلانغان ھەممە ئۈسكۈنىدىن چىقىرىۋېتىلىدۇ.

source: %@ Logo
ug: %@ تۇغى

source: Looks like Firefox crashed previously. Would you like to restore your tabs?
ug: قارىغاندا Firefox ئالدىنقى قېتىم يىمىرىلگەن ئوخشايدۇ. بەتكۈچلىرىڭىزنى ئەسلىگە كەلتۈرەمسىز؟

source: Looks like there’s a problem with your internet connection.
ug: ئىنتېرنېت باغلىنىشىڭىزدا مەسىلە باردەك قىلىدۇ.

source: Mail App
ug: خەت ئەپى

source: Main Menu
ug: ئاساسىي تىزىملىك

source: Making Firefox your default browser is a vote for an open, accessible internet.
ug: Firefox نى سۈكۈتتىكى توركۆرگۈچگە تەڭشەپ، ئوچۇق ۋە قولايلىق تور مۇھىتى يارىتىش ئۈچۈن بىر ھەسسە كۈچ قوشۇڭ.

source: Manage Account & Devices
ug: ھېسابات ۋە ئۈسكۈنىلەرنى باشقۇرۇش

source: Manual
ug: قولدا

source: Manually
ug: قولدا

source: Mark as Read
ug: ئوقۇلغان بەلگىسى قوي

source: Mark as Unread
ug: ئوقۇلمىغان بەلگىسى قوي

source: Mobile Bookmarks
ug: كۆچمە خەتكۈچ

source: mobile device
ug: كۆچمە ئۈسكۈنە

source: Modified %@
ug: ئۆزگەرگەن ۋاقىت %@

source: more than a month ago
ug: بىر ئايدىنمۇ ئىلگىرى

source: more than a week ago
ug: بىر ھەپتىدىنمۇ ئىلگىرى

source: Move the toolbar to the bottom if that’s more your style.
ug: ئەگەر خالىسىڭىز قورال بالداقنى ئاستىغا يۆتكىيەلەيسىز.

source: Move the toolbar to the top if that’s more your style.
ug: ئەگەر خالىسىڭىز قورال بالداقنى چوققىغا يۆتكىيەلەيسىز.

source: Mozilla strives to only collect what we need to provide and improve Firefox for everyone.
ug: Mozilla پەقەت كۆپچىلىككە تەمىنلەيدىغان ۋە Firefox نى ياخشىلاش ئۈچۈن زۆرۈر بولغان ئۇچۇرلارنىلا توپلايدۇ.

source: Navigation Toolbar
ug: يولباشچى قورال بالداق

source: Neighborhood
ug: مەھەللە

source: New Bookmark
ug: يېڭى خەتكۈچ

source: New Card Saved
ug: يېڭى كارتا ساقلاندى

source: New colors. New convenience. Same commitment to people over profits.
ug: تېخىمۇ رەڭدار. تېخىمۇ قۇلايلىق. كىشىلەرنىڭ مەنپەئەتتىن ئۈستۈنلۈكىگە ۋەدە بېرىدۇ.

source: New Folder
ug: يېڭى قىسقۇچ

source: New in %@
ug: %@ دىكى يېڭىلىق

source: New Info To Check
ug: تەكشۈرىدىغان يېڭى ئۇچۇر

source: New Private Search
ug: يېڭى شەخسىي ئىزدەش

source: New Private Tab
ug: يېڭى شەخسىي بەتكۈچ

source: New Private Tab opened
ug: يېڭى شەخسىي بەتكۈچ ئېچىلدى

source: New Private Tab Opened
ug: يېڭى شەخسىي بەتكۈچ ئېچىلدى

source: New Search
ug: يېڭىدىن ئىزدە

source: New Separator
ug: يېڭى ئايرىغۇچ

source: New Tab
ug: يېڭى بەتكۈچ

source: New tab arrived from another device.
ug: باشقا ئۈسكۈنىدىن يېڭى بەتكۈچ كەلدى.

source: New tab arrived in %@
ug: يېڭى بەتكۈچنى %@ دىن تاپشۇرۇۋالدى

source: New Tab opened
ug: يېڭى بەتكۈچ ئېچىلدى

source: New Tab Opened
ug: يېڭى بەتكۈچ ئېچىلدى

source: Next form field
ug: كېيىنكى كۆزنەك بۆلىكى

source: Next in-page result
ug: كېيىنكى بەتتىكى نەتىجىسى

source: Night Mode
ug: كېچىلىك ھالىتى

source: No history found
ug: ھېچقانداق تارىخ خاتىرىسى تېپىلمىدى

source: No Info Available Right Now
ug: ھازىرچە ھېچقانداق ئۇچۇر يوق

source: No Internet Connection
ug: تورغا ئۇلانمىغان

source: No logins found
ug: تىزىمغا كىرىش خاتىرىسى تېپىلمىدى

source: No matching logins
ug: ماس كېلىدىغان كىرىش يوق

source: No Network Connection
ug: تور باغلىنىشى يوق

source: No open tabs.
ug: ئوچۇق بەتكۈچ يوق.

source: No passwords found
ug: پارول تېپىلمىدى

source: No passwords saved
ug: ساقلانغان پارول يوق

source: Normal Browsing Mode
ug: ئادەتتىكى زىيارەت ھالىتى

source: No tabs
ug: بەتكۈچ يوق

source: Not After
ug: كېيىن ئەمەس

source: Not Before
ug: ئىلگىرى ئەمەس

source: Not Enough Reviews Yet
ug: تېخى يېتەرلىك باھالىنىش يوق

source: Notifications help you stay safer with %@
ug: ئۇقتۇرۇش قوزغىتىلسا %@ تېخىمۇ بىخەتەر بولۇشىڭىزغا ياردەم بېرىدۇ

source: No trackers found
ug: ھېچقانداق ئىزلىغۇچى تېپىلمىدى

source: (no username)
ug: (ئىشلەتكۈچى ئاتى يوق)

source: Oblast
ug: ئوبلاست

source: Offer to Open Copied Links
ug: كۆچۈرۈلگەن ئۇلانمىنى ئېچىشقا تەمىنلەيدۇ

source: Offline Website Data
ug: تورسىز تور بېكەت سانلىق مەلۇماتلىرى

source: Okay
ug: ماقۇل

source: Only HTTP and HTTPS links can be shared.
ug: پەقەت HTTP ۋە HTTPS ئۇلانمىلىرىنىلا ھەمبەھىرلىگىلى بولىدۇ.

source: On your computer open Firefox and go to firefox.com/pair
ug: كومپيۇتېرىڭىزدىكى Firefox دا firefox.com/pair نى ئاچىدۇ

source: Oops! Firefox crashed
ug: ئاپلا! Firefox يىمىرىلدى

source: Open App Store
ug: App Store نى ئاچ

source: Open articles in Reader View by tapping the book icon when it appears in the title bar.
ug: ماۋزۇ بالداقتا كىتاب سىنبەلگىسى كۆرۈنگەندە ئۇنى چېكىپ ئوقۇش كۆرۈنۈشىدە ماقالىنى ئاچالايسىز.

source: Open & Fill
ug: ئېچىپ تولدۇر

source: Open Firefox
ug: Firefox نى ئاچ

source: Open in a Private Tab
ug: شەخسىي بەتكۈچتە ئاچ

source: Open in Firefox
ug: Firefox تا ئاچ

source: OPENING SCREEN
ug: ئېچىلىش ئېكرانى

source: Open in New Private Tab
ug: يېڭى شەخسىي بەتكۈچ ئاچ

source: Open in New Tab
ug: يېڭى بەتكۈچتە ئاچ

source: Open in Safari
ug: Safari دا ئاچ

source: Open Last Bookmark
ug: ئاخىرقى خەتكۈچنى ئاچىدۇ

source: Open mail links with
ug: خەت ئۇلانمىسىنى ئاچىدىغىنى

source: Open New Private Tab
ug: يېڭى شەخسىي بەتكۈچ ئاچ

source: Open New Tab
ug: يېڭى بەتكۈچ ئاچ

source: Open Review Checker
ug: باھالاش تەكشۈرگۈچنى ئاچ

source: Open Settings
ug: تەڭشەكنى ئاچ

source: Opens search engine selection
ug: ئىزدەش موتورىنىڭ تاللىشىنى ئاچىدۇ

source: Opens search settings
ug: ئىزدەش تەڭشىكىنى ئاچىدۇ

source: Open synced tab
ug: قەدەمداش بەتكۈچنى ئاچ

source: Open Tabs
ug: ئوچۇق بەتكۈچ

source: Open this link in external app?
ug: بۇ ئۇلىنىشنى سىرتقى ئەپتە ئاچامدۇ؟

source: Open this link in the App Store?
ug: بۇ ئۇلانمىنى App Store دا ئاچامدۇ؟

source: Organization
ug: تەشكىلات

source: Others
ug: باشقا

source: Our Sponsors & Your Privacy
ug: قوللىغۇچىلىرىمىز ۋە شەخسىيىتىڭىز

source: %@ out of 5 stars
ug: %@ يۇلتۇز (يۇقىرىسى 5 يۇلتۇز)

source: Packaging
ug: ئورالما

source: Pages: %d
ug: بەت: %d

source: Parish
ug: تەۋەلىك

source: Password Generator
ug: ئىم ھاسىللىغۇچ

source: Passwords were leaked or stolen since you last changed your password. To protect this account, log in to the site and change your password.
ug: سىز ئىمنى ئاخىرقى قېتىم ئۆزگەرتكەندىن بۇيان ئىم ئاشكارىلاندى ياكى ئوغرىلاندى. بۇ ھېساباتنى قوغداش ئۈچۈن تور بېكەتكە تىزىمغا كىرىپ ئىمنى ئۆزگەرتىڭ.

source: Payment Methods
ug: چىقىم قىلىش ئۇسۇلى

source: Pick a theme
ug: ئۆرنەك تاللىنىدۇ

source: Pick a toolbar placement
ug: قورال بالداق ئورنى تاللىنىدۇ

source: Pick which theme you want
ug: ئېھتىياجلىق ئۆرنەكنى تاللاڭ

source: Pin
ug: Pin پوچتا نومۇرى

source: Please fill all fields correctly.
ug: بارلىق بۆلەكلەرنى توغرا تولدۇرۇڭ.

source: Please help make %@ better by taking a short survey.
ug: قىسقا تەكشۈرۈشكە قاتنىشىپ %@ نى تېخىمۇ ياخشىلاشقا ياردەملىشىڭ.

source: Please open Firefox, go to Settings and sign in to continue.
ug: Firefox نى ئېچىپ، تەڭشەككە يۆتكىلىپ ئاندىن داۋاملاشتۇرۇش ئۈچۈن تىزىمغا كىرىڭ.

source: Postal Code
ug: پوچتا نومۇرى

source: Post town
ug: پوچتا بازار

source: Powered by %1$@. Part of the %2$@ family.
ug: تەمىنلىگۈچى %1$@. %2$@ ئائىلىسىگە تەۋە.

source: Prefecture
ug: ۋىلايەت

source: Preview of %@
ug: %@ ئالدىن كۆزەت

source: Previous form field
ug: ئالدىنقى كۆزنەك بۆلىكى

source: Previous in-page result
ug: ئالدىنقى بەتتىكى نەتىجە

source: Privacy & Security Settings
ug: شەخسىيەت ۋە بىخەتەرلىك تەڭشىكى

source: Privacy settings
ug: شەخسىيەت تەڭشىكى

source: Private Browsing
ug: شەخسىي زىيارەت

source: Private Browsing Data Erased
ug: شەخسىي زىيارەت سانلىق مەلۇماتلىرى ئۆچۈرۈلدى

source: Private browsing in %@ doesn’t save your info and blocks hidden trackers.
ug: شەخسىي زىيارەتتە %@ ئۇچۇرلىرىڭىزنى ساقلىمايدۇ ھەمدە يوشۇرۇن ئىزلىغۇچىلارنى توسىدۇ.

source: Private Browsing Mode
ug: شەخسىي زىيارەت ھالىتى

source: Private Mode
ug: شەخسىي ھالەت

source: Private Session
ug: شەخسىي سۆزلەشكۈ

source: Product Is Not Available
ug: مەھسۇلات يوق

source: Protection Against Ad Tracking
ug: ئېلان ئىز قوغلاشتىن قوغداش

source: Protection Level
ug: قوغداش دەرىجىسى

source: Protections are OFF. We suggest turning it back on.
ug: قوغداش تاقاق. ئۇنى قايتا قوزغىتىشنى تەۋسىيە قىلىمىز.

source: Protections are OFF. We suggest turning them back on.
ug: قوغداش تاقاق. ئۇنى قايتا قوزغىتىشنى تەۋسىيە قىلىمىز.

source: Protect your account by using a strong, randomly generated password.
ug: ئىختىيارى ھاسىللىغان كۈچلۈك ئىم ئارقىلىق ھېساباتىڭىزنى قوغدايدۇ.

source: %@ puts you in control
ug: %@تور زىيارىتىڭىزنى تىزگىنلىيەلەيسىز

source: Quick access to various Firefox actions
ug: نۇرغۇن Firefox مەشغۇلاتلىرىنى تېز زىيارەت قىلالايسىز

source: Quick Action
ug: تېز مەشغۇلات

source: Quick Actions
ug: تېز مەشغۇلات

source: Quick Action Type
ug: تېز مەشغۇلات تىپى

source: Quick-Search Engines
ug: تېز ئىزدەش موتورى

source: Quick View
ug: تېز كۆرۈش

source: Rate on App Store
ug: App Store دىكى باھا

source: read
ug: ئوقۇلدى

source: Reader Mode available
ug: ئوقۇش ھالىتى تەييار

source: Reader View
ug: ئوقۇرمەن كۆرۈنۈشى

source: Reading list
ug: ئوقۇش تىزىمى

source: Reading List
ug: ئوقۇش تىزىمى

source: Ready to Scan
ug: تاراشقا تەييار

source: Recently Closed
ug: يېقىندا تاقالغان

source: Recently Closed Tabs
ug: يېقىندا تاقالغان بەتكۈچ

source: Recently Saved
ug: يېقىندا ساقلانغان

source: Recently Visited
ug: يېقىندا زىيارەت قىلغان

source: Recommended by Pocket
ug: Pocket تەۋسىيەسى

source: Reduces targeted ads and helps stop advertisers from tracking your browsing.
ug: نىشانلىق ئېلاننى ئازايتىدۇ ۋە ئېلان بەرگۈچىلەرنىڭ تور كۆرگۈڭىزنى ئىزلىشىنى توختىتىدۇ.

source: Reload Ignoring Cache
ug: غەملەككە پەرۋا قىلماي قايتا يۈكلە

source: Reload page
ug: بەتنى قايتا يۈكلە

source: Reload Page
ug: بەتنى قايتا يۈكلە

source: Reload Without Tracking Protection
ug: كۈچەيتىلگەن ئىزلاشتىن قوغداشسىز قايتا يۈكلە

source: Reload With Tracking Protection
ug: كۈچەيتىلگەن ئىزلاشتىن قوغداشنى قايتا يۈكلە

source: Remember this card?
ug: بۇ كارتىنى ئەستە تۇتامدۇ؟

source: Remove Address
ug: ئادرېسنى چىقىرىۋەت

source: Remove Bookmark
ug: خەتكۈچنى چىقىرىۋەت

source: Remove Card
ug: كارتىنى چىقىرىۋەت

source: Remove Card?
ug: كارتىنى چىقىرىۋېتەمدۇ؟

source: Removed from Reading List
ug: ئوقۇش تىزىمىدىن چىقىرىۋېتىلدى

source: Removed from Shortcuts
ug: تېزلەتمىدىن چىقىرىۋېتىلدى

source: Remove from Reading List
ug: ئوقۇش تىزىمىدىن چىقىرىۋەت

source: Remove from Shortcuts
ug: تېزلەتمىدىن چىقىرىۋەت

source: Remove page
ug: بەتنى چىقىرىۋەت

source: Remove page — %@
ug: بەتنى چىقىرىۋەت-%@

source: Remove Password?
ug: پارولنى چىقىرىۋېتەمسىز؟

source: Remove This Card?
ug: بۇ كارتىنى چىقىرىۋېتەمدۇ؟

source: Removing cookies and site data for %@ might log you out of websites and clear shopping carts.
ug: %@ نىڭ ساقلانما ۋە تور بېكەت سانلىق مەلۇماتلىرىنى چىقىرىۋەتسە سىزنى تور بېكەت تىزىمىدىن چىقىرىپ، مال ھارۋىسىنىمۇ تازىلىۋېتىشى مۇمكىن.

source: Reopen
ug: قايتا ئاچ

source: Reopen Last Closed Tab
ug: تاقالغان ئاخىرقى بەتكۈچنى قايتا ئاچ

source: Report Broken Site
ug: بۇزۇلغان بېكەتنى دوكلات قىل

source: Report Broken Site…
ug: بۇزۇلغان بېكەتنى دوكلات قىلىدۇ…

source: Report Product Back in Stock
ug: مەھسۇلاتنىڭ تىزىلغانلىقىنى دوكلات قىلىڭ

source: Report Site Issue
ug: تور بېكەت مەسىلىسى دوكلاتى

source: Request Desktop Site
ug: ئۈستەل ئۈستى تور بېكىتى ئىلتىماسى

source: Request Mobile Site
ug: كۆچمە تور بېكەت ئىلتىماسى

source: Reset text size
ug: خەت چوڭلۇقىنى ئەسلىگە قايتۇر

source: Restore tabs
ug: بەتكۈچنى ئەسلىگە قايتۇر

source: Results from searches, history, bookmarks, and more
ug: ئىزدەش، تارىخ، خەتكۈچ ۋە باشقىلارنىڭ نەتىجىلىرى

source: Reveal
ug: كۆرسەت

source: Review Checker is powered by %1$@ by %2$@
ug: باھالاش تەكشۈرگۈچنى %2$@ قوللايدىغان %1$@ تەمىنلىگەن

source: Rows
ug: قۇر

source: Save Addresses to %@
ug: ئاردرېسنى %@ غا ساقلايدۇ

source: Save and Autofill Cards
ug: ساقلاپ كارتا ئۇچۇرىنى ئۆزلۈكىدىن تولدۇرىدۇ

source: Save and Continue
ug: ساقلاپ داۋاملاشتۇر

source: Save and Fill Addresses
ug: ساقلاپ ئادرېسنى تولدۇرىدۇ

source: Save and Fill Payment Methods
ug: پۇل تۆلەش ئۇسۇلىنى ساقلاش ۋە تولدۇرۇش

source: Save and Start Browsing
ug: ساقلاپ باشلا

source: Save Cards to %@
ug: كارتىنى %@ گە ساقلا

source: Save Credit Cards to %@
ug: ئىناۋەتلىك كارتىنى %@ قا ساقلايدۇ

source: SAVED ADDRESSES
ug: ساقلانغان ئادرېس

source: SAVED CARDS
ug: ساقلانغان كارتا

source: Saved Logins
ug: ساقلانغان كىرىش

source: SAVED LOGINS
ug: ساقلانغان تىزىمغا كىرىش

source: Saved logins will show up here. If you saved your logins to Firefox on a different device, sign in to your Firefox Account.
ug: ساقلانغان تىزىمغا كىرىش خاتىرىلىرى بۇ يەردە كۆرۈنىدۇ. ئەگەر پەرقلىق ئۈسكۈنىڭىزدە تىزىمغا كىرىش خاتىرىلىرىنى Firefox غا ساقلىۋالغان بولسىڭىز، Firefox ھېساباتىڭىزغا كىرىڭ.

source: Saved logins will show up here. If you saved your logins to %@ on a different device, sign in to your account.
ug: ساقلانغان تىزىمغا كىرىش خاتىرىلىرى بۇ يەردە كۆرۈنىدۇ. ئەگەر پەرقلىق ئۈسكۈنىڭىزدە تىزىمغا كىرىش خاتىرىلىرىنى %@ غا ساقلىۋالغان بولسىڭىز، ھېساباتىڭىزغا كىرىڭ.

source: SAVED PASSWORDS
ug: ساقلانغان پارول

source: Save Image
ug: سۈرەتنى ساقلا

source: Save Login
ug: تىزىمغا كىرىشنى ساقلا

source: Save login %1$@ for %2$@?
ug: %1$@ نىڭ %2$@ دىكى تىزىمغا كىرىش ئۇچۇرىنى ساقلامدۇ؟

source: Save Logins
ug: تىزىمغا كىرىشنى ساقلا

source: Save pages to your Reading List by tapping the book plus icon in the Reader View controls.
ug: ئوقۇش كۆرۈنۈشىدە كىتاب قوشۇش سىنبەلگىنى چېكىپ، بەتنى ئوقۇش تىزىمىڭىزغا قوشقىلى بولىدۇ.

source: Save password for %@?
ug: %@ ئۈچۈن ئىم ساقلامدۇ؟

source: Save Passwords
ug: ئىم ساقلا

source: Save submenu
ug: تارماق تىزىملىكنى ساقلا

source: Save to Reading List
ug: ئوقۇش تىزىمىغا ساقلا

source: Save username?
ug: ئىشلەتكۈچى ئاتىنى ساقلامسىز؟

source: Save your card information securely to check out faster next time.
ug: كېلەر قېتىم ئىشلەتكەندە تېز بولۇشى ئۈچۈن كارتا ئۇچۇرلىرىڭىزنى بىخەتەر ساقلايدۇ.

source: Save your card information securely with %@ to check out faster next time.
ug: كېلەر قېتىم ئىشلەتكەندە تېز بولۇشى ئۈچۈن %@ كارتا ئۇچۇرلىرىڭىزنى بىخەتەر ساقلايدۇ.

source: Scan QR Code
ug: QR كودىنى تارا

source: %@ search
ug: %@ ئىزدە

source: Search Bookmarks
ug: خەتكۈچ ئىزدە

source: Search Browsing History
ug: زىيارەت تارىخىنى ئىزدە

source: Search Engine
ug: ئىزدەش موتورى

source: Search Engine: %@
ug: ئىزدەش موتورى: %@

source: Search in Firefox
ug: Firefox تا ئىزدە

source: Search in Private Tab
ug: شەخسىي بەتكۈچتە ئىزدە

source: Search Input Field
ug: ئىزدەش رامكىسى

source: Search Settings
ug: ئىزدەش تەڭشىكى

source: Search Synced Tabs
ug: قەدەمداش بەتكۈچ ئىزدە

source: Search with Firefox
ug: Firefox تا ئىزدە

source: Secure connection
ug: بىخەتەر باغلىنىش

source: Secure connection. Enhanced Tracking Protection is off.
ug: بىخەتەر باغلىنىش. كۈچەيتىلگەن ئىزلاشتىن قوغداش تاقاق.

source: Securely save your information to get quick access to it later.
ug: كېيىنچە تېز زىيارەت قىلىش ئۈچۈن ئۇچۇرلىرىڭىزنى بىخەتەر ساقلايدۇ.

source: Securely send tabs between your devices and discover other privacy features in %@.
ug: ئۈسكۈنىڭىز ئارىسىدا بەتكۈچلەرنى بىخەتەر ئەۋەتىپ، %@ دىكى باشقا شەخسىيەت ئىقتىدارلىرىنى بايقايدۇ.

source: See All
ug: ھەممىنى كۆرسەت

source: See how reliable product reviews are on %1$@ before you buy. Review Checker, an experimental feature from %2$@, is built right into the browser.
ug: سېتىۋېلىشتىن ئىلگىرى %1$@ دا مەھسۇلات باھالاش تەكشۈرۈشنىڭ قانچىلىك ئىشەنچلىك ئىكەنلىكىنى كۆرۈڭ. باھالاش تەكشۈرگۈچ، %2$@ نىڭ تەجرىبە ئىقتىدارى تور كۆرگۈچكە قۇرۇلدى.

source: See how reliable product reviews are on %1$@ before you buy. Review Checker, an experimental feature from %2$@, is built right into the browser. It works on %3$@ and %4$@, too.
ug: سېتىۋېلىشتىن ئىلگىرى %1$@ دا مەھسۇلات باھالاش تەكشۈرۈشنىڭ قانچىلىك ئىشەنچلىك ئىكەنلىكىنى كۆرۈڭ. باھالاش تەكشۈرگۈچ، %2$@ نىڭ تەجرىبە ئىقتىدارى تور كۆرگۈچكە قۇرۇلدى. ئۇ %3$@ ۋە %4$@ دىمۇ ئىشلەيدۇ.

source: See the web in the best light.
ug: سىز ياقتۇرىدىغان رەڭدە تورنى زىيارەت قىلىڭ.

source: Select All
ug: ھەممىنى تاللا

source: Select a password to fill
ug: تولدۇرىدىغان پارول تاللىنىدۇ

source: Select Location Bar
ug: ئورۇن بالدىقى تاللىنىدۇ

source: Send a crash report so Mozilla can fix the problem?
ug: مەسىلىنى ئوڭشاش ئۈچۈن Mozilla غا يىمىرىلىش دوكلاتى يوللامدۇ؟

source: Send Feedback
ug: قايتۇرما ئىنكاس يوللا

source: Send Link to Device
ug: ئۈسكۈنىگە ئۇلانما يوللا

source: Send Report
ug: دوكلات يوللا

source: Send Tab
ug: بەتكۈچ يوللا

source: Send to Device
ug: ئۈسكۈنىگە يوللا

source: Send Usage Data
ug: ئىشلىتىش سانلىق مەلۇماتلىرىنى يوللايدۇ

source: Set as Default Browser
ug: كۆڭۈلدىكى توركۆرگۈ قىلىپ تەڭشە

source: Set links from websites, emails, and Messages to open automatically in Firefox.
ug: تور بېكەت، ئېلخەت ۋە ئۇچۇر ئۇلانمىلىرىنى Firefox تا ئاپتوماتىك ئېچىشقا تەڭشەيدۇ.

source: Set Rows
ug: قۇر تەڭشىكى

source: Set Wallpaper
ug: تام قەغىزى تەڭشەش

source: Set your theme and toolbar to match your unique browsing style.
ug: زىيارەت قىلىش ئۇسلۇبىڭىزغا ئاساسەن ئۆرنەك ۋە قورال بالداقنى تەڭشەڭ.

source: Share Link
ug: ئۇلانما ھەمبەھىر

source: Share Page With…
ug: بەتنى ھەمبەھىرلە…

source: Share this page
ug: بۇ بەتنى ھەمبەھىرلە

source: Shortcut
ug: تېزلەتمە

source: Show
ug: كۆرسەت

source: Show All
ug: ھەممىنى كۆرسەت

source: Show All Tabs
ug: بارلىق بەتكۈچلەرنى كۆرسەت

source: Show Bookmarks
ug: خەتكۈچلەرنى كۆرسەت

source: Show Downloads
ug: چۈشۈرۈلمىلەرنى كۆرسەت

source: Show First Tab
ug: بىرىنچى بەتكۈچنى كۆرسەت

source: Show History
ug: تارىخنى كۆرسەت

source: Show in Application Menu
ug: ئەپ تىزىملىكىدە كۆرسىتىدۇ

source: Show in Private Sessions
ug: شەخسىي سۆزلەشكۈدە كۆرسىتىدۇ

source: Show Last Tab
ug: ئاخىرقى بەتكۈچنى كۆرسەت

source: Show Less
ug: ئازراق كۆرسەت

source: Show Link Previews
ug: ئۇلانما ئالدىن كۆزىتىشنى كۆرسىتىدۇ

source: Show More
ug: تەپسىلىي كۆرسەت

source: Show Next Tab
ug: كېيىنكى بەتكۈچنى كۆرسەت

source: Show Previous Tab
ug: ئالدىنقى بەتكۈچنى كۆرسەت

source: Show products recommended by %@
ug: %@ تەۋسىيە قىلغان مەھسۇلاتلارنى كۆرسىتىدۇ

source: Show Search Suggestions
ug: ئىزدەش تەكلىپلىرىنى كۆرسىتىدۇ

source: Show suggestions from Firefox Suggest in private sessions
ug: شەخسىي سۆزلەشكۈدىكى Firefox تەۋسىيەسىنى كۆرسىتىدۇ

source: Show suggestions from search engines in private sessions
ug: شەخسىي سۆزلەشكۈدىكى ئىزدەش موتورىنىڭ تەۋسىيەسىنى كۆرسىتىدۇ

source: Show Suggestions in Private Browsing
ug: شەخسىي زىيارەتتە تەكلىپلەرنى كۆرسىتىدۇ

source: Show Tabs
ug: بەتكۈچنى كۆرسەت

source: Show Tabs: %@
ug: بەتكۈچنى كۆرسىتىش: %@

source: Show Tour
ug: يېتەكچى كۆرسەت

source: Sign In
ug: تىزىمغا كىرىڭ

source: Sign in to sync passwords, tabs, and more
ug: ئىم، بەتكۈچ ۋە باشقىلارنى قەدەمداشلاش ئۈچۈن تىزىمغا كىرىش كېرەك

source: Sign in to view a list of tabs from your other devices.
ug: باشقا ئۈسكۈنىلىرىڭىزدىكى بەتكۈچ تىزىمىنى كۆرۈش ئۈچۈن تىزىمغا كىرىڭ.

source: Sign In with Your Camera
ug: كامېرايىڭىز بىلەن تىزىمغا كىرىڭ

source: Siri Shortcuts
ug: Siri تېزلەتمىسى

source: Social media trackers: %@
ug: ئىجتىمائىي تاراتقۇ ئىزلىغۇچ: %@

source: Social networks place trackers on other websites to build a more complete and targeted profile of you. Blocking these trackers reduces how much social media companies can see what do you online.
ug: ئىجتىمائىي ئالاقە تورى تېخىمۇ مۇكەممەل ۋە نىشانلىق تەرجىمىھالىڭىزنى تۇرغۇزۇش ئۈچۈن ئىز قوغلىغۇچىلارنى باشقا تور بېكەتلەرگە قويىدۇ. بۇ ئىز قوغلىغۇچىلارنى توسۇش سىزنىڭ توردا نېمىلەرنى كۆرگەنلىكىڭىزنى ئىجتىمائىي ئالاقە شىركەتلىرىنىڭ بىلىشىنى ئازايتىدۇ.

source: Social Trackers
ug: ئىجتىمائىي تاراتقۇ ئىزلىغۇچى

source: Something went wrong with this wallpaper.
ug: بۇ تام قەغىزىدە خاتالىق كۆرۈلدى.

source: Something went wrong with your download.
ug: چۈشۈرۈشتە خاتالىق كۆرۈلدى.

source: Sorry about that. Restore tabs to pick up where you left off.
ug: كەچۈرۈڭ. بەتكۈچلەرنى قەيەردە ئۈزۈلگەن بولسا شۇ جايدىن ئەسلىگە قايتۇرىدۇ.

source: Sponsored Shortcuts
ug: قوللايدىغانلار تېزلەتمىسى

source: Spotlight Index
ug: قىزىق نۇقتا كۆرسەتكۈچى

source: Spread the word about %1$@ every time you share a link on %2$@.
ug: ھەر قېتىم %2$@ غا ھەمبەھىرلىگەندە %1$@ نىمۇ تەشۋىق قىلىدۇ.

source: %@’s privacy notice
ug: %@ نىڭ شەخسىيەت ئۇقتۇرۇشى

source: Start Browsing
ug: زىيارەتنى باشلاڭ

source: %@’s terms of use
ug: %@ نىڭ ئىشلىتىش شەرتلىرى

source: Subject Alt Names
ug: تېما ئالماشتۇرۇش ئىسمى

source: Subject Name
ug: تېما ئىسمى

source: Suburb
ug: شەھەر ئەتراپى

source: Successfully Downloaded PDF
ug: PDF مۇۋەپپەقىيەتلىك چۈشۈرۈلدى

source: Suggestions from %@
ug: %@ نىڭ تەكلىپى

source: Suggestions from Search Engines
ug: ئىزدەش موتورىنىڭ تەۋسىيەسى

source: Suggestions from Sponsors
ug: ياردەمچىنىڭ تەكلىپلىرى

source: Suggestions from the Web
ug: تورنىڭ تەۋسىيەسى

source: Support %@ with occasional sponsored suggestions
ug: قوللاش سودىگەرلىرىنىڭ ئېلانىنى ئانچە-مۇنچە كۆرسىتىشىگە يول قويۇپ %@ نى قوللاڭ

source: Survey
ug: راي سىناش

source: Swipe right or left with three fingers to close the tab.
ug: ئۈچ بارماق بىلەن ئوڭ ياكى سولغا سىيرىلسا بەتكۈچنى تاقايدۇ.
